Revit 2027 API
NumberingSchemaType Constructor
Creates a new NumberingSchemaType instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingSchemaType(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
NumberingSchemaType(
	Guid guid
)
new :
        guid : Guid -> NumberingSchemaType
Parameters
guid Guid
The identifier for the NumberingSchemaType.
See Also
Reference
NumberingSchemaType Class
Autodesk.Revit.DB Namespace